Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/MediaConf/SetMetadataConfiguration/SetMetadataConfiguration.01.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trt:SetMetadataConfiguration>
      <trt:Configuration token="encoder1">
        <tt:Name>TestName1</tt:Name>
        <tt:UseCount>1</tt:UseCount>
        <tt:PTZStatus>
          <tt:Status>true</tt:Status>
          <tt:Position>true</tt:Position>
        </tt:PTZStatus>
        <tt:Analytics>true</tt:Analytics>
        <tt:Multicast>
          <tt:Address>
            <tt:Type>IPv4</tt:Type>
            <tt:IPv4Address>255.255.255.255</tt:IPv4Address>
          </tt:Address>
          <tt:Port>1234</tt:Port>
          <tt:TTL>1</tt:TTL>
          <tt:AutoStart>true</tt:AutoStart>
        </tt:Multicast>
        <tt:SessionTimeout>PT1H1M1S</tt:SessionTimeout>
        <tt:AnalyticsEngineConfiguration>
          <tt:AnalyticsModule>
            <tt:Parameters Name="Param1" Type="ConfType1">
              <tt:SimpleItem Name="RecordingToken" Value="tokenRecording1"/>
            </tt:Parameters>
          </tt:AnalyticsModule>
        </tt:AnalyticsEngineConfiguration>
      </trt:Configuration>
      <trt:ForcePersistence>true</trt:ForcePersistence>
    </trt:SetMetadataConfiguration>
  </soap:Body>
</soap:Envelope>